import { SceneTypes } from '$enums';
import { Tags } from '$enums';
import type { Continent } from '../../../types';

export default {
	name: '????',
	hidden: true,
	emoji: '',
	countries: [
		{
			name: '█████',
			scenes: [
				{
					name: 'ą̸̬̗̱̦̪̟̟̬͖͖̞̳̤͚͖̩̱͖̺̟̳͉̰̣̠̭̪͔̝̽͛̆́́̓̍̽̓͂́̑́̏̅͆̈́̄͛̾̓̅̃̈́̈́̀͋͋̇̔̈̆̔̈́̅͂̚̚͠͝͠ͅͅͅơ̴̛̛͚̣͇͓̗̯̳̫͉̱̙͍̲̣͇͚̅͗̋̈́̈́͂̌͛̇̊́̿̀̓͂͋́͆̾͂̽́̈͑̏̎́̿͒̄̀͑̅̉̂̐̅̂͘͜͝͝͠͝͠͝͠ͅk̶̡̡̢̼͉̟͓̯̣̟̮̰͔̮̐̂̃́͗̅̆͊̆̐̋́͊̌̒̈́̂̓̏̋̉͋̈́͑̽͛̀̚̚͠͝į̵̡̢̧̢̡̛̛̹̥̗͉̲̗̗̪̼̘̫͕̖̗̬̗̦̬̦̼͔̩͚̫͙͍̰̳͔̤͎̞̠̹̲͍̯̱̭̬̱̌͛̊͐̍͌͌̂̐͂͒̉̽͛̿̊̂͛͊̓͂̽͊̔͘͘̕̚ͅg̷̢̧̧̜̜̻̭̬̱͔̥̞̔͛͂͆͂̔̒̓͑͒̑̿̓ȃ̴̢̼͚̙͎̱̲͕͙̹̼͈̼̃̔͝ḥ̶̨̡̢̡̢͇͚͈̱̮͕͖̮̑̅͘ͅa̶̧̡̧̡̡̨̢̛̛̫͙̹̫̬͓̼͍͚͉̻͚̱̻̪̟̼̮̰͇͇̫͉̮̳͕̬̗͇͉̖͇̗̟̓͒͂͊̿̈́̽̌̋͆̅̎̍͒̋͗̓̀̎͑̉̍͘͝͠ͅr̵̡̨̡̜͓̥̗̥̜̮̰̱͓̱̝̟̫̮̤̪̗͉̥͍͓͈̮̖̈́̎̃̊̂̍̐͛̒̊͗́̂͊̄͑̂̀̎͛̊̈̿̓͒̀̈́͐͗̔̈́͋̿̀̀̈́́̓̾͗̉̀̄̌̕͘͘͜a̴̢̢̧̙̯̟̗͔͉͕͚̜̟̩̜̳̖̼̺̺̳̺̬̗͓̼̤̯͆̀̔͆̈́̈́̉̿̽̓̏̀̄̌̕̚̚͜͝',
					videoID: 'hqsQY-QXI2U',
					type: SceneTypes.walk,
					offset: { start: 30 },
					tags: [Tags.halloween],
					hidden: true
				},
				{
					name: '原༙྇҉ヶ༙྇҉木༙྇҉青༙྇҉',
					videoID: '71YRmpH1iMk',
					type: SceneTypes.walk,
					offset: { start: 30 },
					tags: [Tags.halloween],
					hidden: true
				},
				{
					name: 'ĥ̷̡̬̗͍̺͈̗͓̗̭̙̖̖͍̓̑̔́́́̎̋͊̿͜͠ ̴̘̫̬̭̗̦̒͒̂͛͛̓̀̔͛̑͂̒̕ę̴̦̙̠̥̜̺̪̪͎̝̰̍̎̔̒͐̿ ̶̜̖̹̂̀̊̾l̵̨̜͕̝͍͐̓̏̃̽̆̚̚͝͝ͅͅ ̷̧̛̣̹̰̰̞͈̳̘͛͆́̀̾l̶̯̥͓̱̰͂͌̓̉͂̐̈̆̈́̓͘̕ͅ',
					videoID: 'bIqsVhvOTr8',
					type: SceneTypes.walk,
					offset: { start: 30 },
					tags: [Tags.halloween],
					hidden: true
				},
				{
					name: 'ţ̸̮̪͕̩̖̝̣̦̩̘̥̳͒͌̈͂͆̓̀͛̈͂̊̾̇̎͠ͅh̴̢̫̮̜̫͍̳̗͒̈́͛̀͒̒̑̍̚ͅè̸̠͔̳͙̳͔̘̭͖͈̠̣̈́͐ ̸̛̗̹̳̦̫̟͉̠̯̪̼̮͕́̊̔̂͑̽̓̒̃̅̿͂̓̕ͅm̸̥̳̈́ ̶͖̝͓͖̅͒̑͋̃̿͛͊͋̓̀̑̑͘͝ó̸̱̗̠̾̄͂͗̉̾̈́̌͋̎̇͒͠ ̷̳͈̼̎̉̾̓́͠͠s̴̛̛̜̥̖̾̽̍̊̐̋̚͠ ̶͓̺̥̜̎͌t̷̡͉̞̟͕̹͈̪̹̅̌̓̎͆̎̅̓̈͠ ̷̪̦͉̰́̍̏̀̈́̄͊̀͋̍́̓͘͝d̴͈̺͕̔̒̐͊̇ą̵̨̨͕͚̪̩͚̞̖̫̀̇̒̈̅̐̑̒̕̕̕͝n̸͎͚͔̹̮̙̗͚̈́̇̊g̵̦̩̭̲̰͈̹͑̏́͛̐͂͒̑̐͊͠ͅͅę̴̰̞͔̑̿͑͜r̸̨͕̥̹͔͇̥͙̰͎̣̜͖̺͎̆͊̊̃̊̾͛̇̈̽̌͋̇̕͝ö̶̹̹̫́̈́͆̐̆͆̓͗̈̾̃u̴̻̳̽́̔͆̌̍͘͘̕s̸̢̟̯̟̤͉͕̦̘̮͚̓́̔̍͛̋ ̷̢̼͇̞̫͙͍̀͋͒̑͌̏r̵̨̡̧̳͔͍̟̽͑͊̋̅̀͑̑̇̈́̕͘͝ǒ̸̳͖͖̭̖̹̰͇̦͈̠̥̗̱͎͑ ̷̛̻̞͖̩̺͕̟̳̪͖̪̆͂̅͗͘͠ą̴͕̮͚̝̩̘͕̼͊̈́͋̓͛̒͆͗͂͊͑̾̉̚ḑ̶̭͇̺̹̲̫́͒̿̑́͑̓̐͗͋͜',
					videoID: '0sb_Bh0cxeg',
					type: SceneTypes.drive,
					offset: { start: 1429 },
					tags: [Tags.halloween],
					hidden: true
				}
			]
		}
	]
} satisfies Continent;
