import { Genre, type Scene } from '$lib/types';
import { Countries } from './countries';

import { stations } from './stations';
import { SceneTypes } from './types';

export default [
	/* -------------------------------------------------------------------------- */
	/*                                    Korea                                   */
	/* -------------------------------------------------------------------------- */

	/* ------------------------------------------------------------------- */
	/*                              Halloween                              */
	/* ------------------------------------------------------------------- */

	{
		name: 'ą̸̬̗̱̦̪̟̟̬͖͖̞̳̤͚͖̩̱͖̺̟̳͉̰̣̠̭̪͔̝̽͛̆́́̓̍̽̓͂́̑́̏̅͆̈́̄͛̾̓̅̃̈́̈́̀͋͋̇̔̈̆̔̈́̅͂̚̚͠͝͠ͅͅͅơ̴̛̛͚̣͇͓̗̯̳̫͉̱̙͍̲̣͇͚̅͗̋̈́̈́͂̌͛̇̊́̿̀̓͂͋́͆̾͂̽́̈͑̏̎́̿͒̄̀͑̅̉̂̐̅̂͘͜͝͝͠͝͠͝͠ͅk̶̡̡̢̼͉̟͓̯̣̟̮̰͔̮̐̂̃́͗̅̆͊̆̐̋́͊̌̒̈́̂̓̏̋̉͋̈́͑̽͛̀̚̚͠͝į̵̡̢̧̢̡̛̛̹̥̗͉̲̗̗̪̼̘̫͕̖̗̬̗̦̬̦̼͔̩͚̫͙͍̰̳͔̤͎̞̠̹̲͍̯̱̭̬̱̌͛̊͐̍͌͌̂̐͂͒̉̽͛̿̊̂͛͊̓͂̽͊̔͘͘̕̚ͅg̷̢̧̧̜̜̻̭̬̱͔̥̞̔͛͂͆͂̔̒̓͑͒̑̿̓ȃ̴̢̼͚̙͎̱̲͕͙̹̼͈̼̃̔͝ḥ̶̨̡̢̡̢͇͚͈̱̮͕͖̮̑̅͘ͅa̶̧̡̧̡̡̨̢̛̛̫͙̹̫̬͓̼͍͚͉̻͚̱̻̪̟̼̮̰͇͇̫͉̮̳͕̬̗͇͉̖͇̗̟̓͒͂͊̿̈́̽̌̋͆̅̎̍͒̋͗̓̀̎͑̉̍͘͝͠ͅr̵̡̨̡̜͓̥̗̥̜̮̰̱͓̱̝̟̫̮̤̪̗͉̥͍͓͈̮̖̈́̎̃̊̂̍̐͛̒̊͗́̂͊̄͑̂̀̎͛̊̈̿̓͒̀̈́͐͗̔̈́͋̿̀̀̈́́̓̾͗̉̀̄̌̕͘͘͜a̴̢̢̧̙̯̟̗͔͉͕͚̜̟̩̜̳̖̼̺̺̳̺̬̗͓̼̤̯͆̀̔͆̈́̈́̉̿̽̓̏̀̄̌̕̚̚͜͝',
		videoID: 'hqsQY-QXI2U',
		type: SceneTypes.walk,
		offset: { start: 30 },
		country: Countries.redacted
	},
	{
		name: '原༙྇҉ヶ༙྇҉木༙྇҉青༙྇҉',
		videoID: '71YRmpH1iMk',
		type: SceneTypes.walk,
		offset: { start: 30 },
		country: Countries.redacted
	},
	{
		name: 'ĥ̷̡̬̗͍̺͈̗͓̗̭̙̖̖͍̓̑̔́́́̎̋͊̿͜͠ ̴̘̫̬̭̗̦̒͒̂͛͛̓̀̔͛̑͂̒̕ę̴̦̙̠̥̜̺̪̪͎̝̰̍̎̔̒͐̿ ̶̜̖̹̂̀̊̾l̵̨̜͕̝͍͐̓̏̃̽̆̚̚͝͝ͅͅ ̷̧̛̣̹̰̰̞͈̳̘͛͆́̀̾l̶̯̥͓̱̰͂͌̓̉͂̐̈̆̈́̓͘̕ͅ',
		videoID: 'bIqsVhvOTr8',
		type: SceneTypes.walk,
		offset: { start: 30 },
		country: Countries.redacted
	},
	{
		name: 'ţ̸̮̪͕̩̖̝̣̦̩̘̥̳͒͌̈͂͆̓̀͛̈͂̊̾̇̎͠ͅh̴̢̫̮̜̫͍̳̗͒̈́͛̀͒̒̑̍̚ͅè̸̠͔̳͙̳͔̘̭͖͈̠̣̈́͐ ̸̛̗̹̳̦̫̟͉̠̯̪̼̮͕́̊̔̂͑̽̓̒̃̅̿͂̓̕ͅm̸̥̳̈́ ̶͖̝͓͖̅͒̑͋̃̿͛͊͋̓̀̑̑͘͝ó̸̱̗̠̾̄͂͗̉̾̈́̌͋̎̇͒͠ ̷̳͈̼̎̉̾̓́͠͠s̴̛̛̜̥̖̾̽̍̊̐̋̚͠ ̶͓̺̥̜̎͌t̷̡͉̞̟͕̹͈̪̹̅̌̓̎͆̎̅̓̈͠ ̷̪̦͉̰́̍̏̀̈́̄͊̀͋̍́̓͘͝d̴͈̺͕̔̒̐͊̇ą̵̨̨͕͚̪̩͚̞̖̫̀̇̒̈̅̐̑̒̕̕̕͝n̸͎͚͔̹̮̙̗͚̈́̇̊g̵̦̩̭̲̰͈̹͑̏́͛̐͂͒̑̐͊͠ͅͅę̴̰̞͔̑̿͑͜r̸̨͕̥̹͔͇̥͙̰͎̣̜͖̺͎̆͊̊̃̊̾͛̇̈̽̌͋̇̕͝ö̶̹̹̫́̈́͆̐̆͆̓͗̈̾̃u̴̻̳̽́̔͆̌̍͘͘̕s̸̢̟̯̟̤͉͕̦̘̮͚̓́̔̍͛̋ ̷̢̼͇̞̫͙͍̀͋͒̑͌̏r̵̨̡̧̳͔͍̟̽͑͊̋̅̀͑̑̇̈́̕͘͝ǒ̸̳͖͖̭̖̹̰͇̦͈̠̥̗̱͎͑ ̷̛̻̞͖̩̺͕̟̳̪͖̪̆͂̅͗͘͠ą̴͕̮͚̝̩̘͕̼͊̈́͋̓͛̒͆͗͂͊͑̾̉̚ḑ̶̭͇̺̹̲̫́͒̿̑́͑̓̐͗͋͜',
		videoID: '0sb_Bh0cxeg',
		type: SceneTypes.drive,
		offset: { start: 1429 },
		country: Countries.redacted
	}
] satisfies Scene[];

export const calmScenes = scenes.filter((b) => {
	return (
		!b.suggestedTrack || [Genre.jazz, Genre.classical, Genre.lofi].includes(b.suggestedTrack.genre)
	);
});
